# 1. Base64 인코딩 기댓값 (복호화 키)
keys = [
    0x725647623174575A, 0x6B52476172465759, 
    0x716C475A6B465761, 0x68686D613346485A,
    0x724E476435565849, 0x7568585A734E5849, 
    0x7A70325A72465362, 0x685147626D526D5A
]

# 2. 스택에 셋팅되었던 암호화된 값
enc_flag = [
    0x1662225B500F1F1E, 0x586421021622613B, 
    0x4355256C0D233504, 0x515E0F0303747A3F,
    0x432C735506646A71, 0x140D686D112B692B, 
    0x4949566843243750, 0x153223005861546B
]

flag = ""
for k, c in zip(keys, enc_flag):
    # XOR 연산 후 8바이트 리틀엔디안 문자열로 변환
    flag += (k ^ c).to_bytes(8, 'little').decode()

print("Flag:", flag)